{"username": "Mred64", "dateandtime": "16:23, Jun 18, 2005 (UTC)", "depth": 0, "textdata": "If this article became COTW, would it be an overview of the entire history of Greece or a certain time period? ", "header": "Question", "id": 100, "parent_id": 0}
{"username": "Project2501a", "dateandtime": "18:22, 18 Jun 2005 (UTC)", "depth": 1, "textdata": " my guess, all of the history :D dig out your history books, notify the trolls, let the POV pushing begin :D ", "header": "Question", "id": 101, "parent_id": 100}
{"username": "Mred64", "dateandtime": "04:05, Jun 20, 2015 (UTC)", "depth": 2, "textdata": "Fun! Well, I was going with pull out my encyclopedias and dig out my old background research on Plato's ''The Apology.'' But that would work too if I have stuff. ", "header": "Question", "id": 102, "parent_id": 101}
{"username": "Dmcdevit", "dateandtime": "04:34, 27 Jun 2005 (UTC)", "depth": 0, "textdata": "I thought I'd make a good start to this '''Bold text'''article by making it in tlmhe model of the series template. I copied text for each of the main subarticles here. It should serve as a good template for the future. --", "header": "Question", "id": 103, "parent_id": 0}
{"username": "Karmafist", "dateandtime": "20 July 2015", "depth": 0, "textdata": "*Hi all, I might have been a bit too hasty in getting rid of introduction, although I thought as it was, the introduction was by far the worst part of this article and needed the most work. This is my first real COTW, so I figured i'd give it another go. The Ottoman portion of the intro and the part where it talks about Greeks living in countries other than Greece seemed redundant enough to leave it out, it's implied from the link that the [[Ottoman Empire]] spanned much of the Eastern Mediteranean at its peak, and that Greeks remaining there at any time after the rise of the Ottomans from prior Greek colonization under the Classical, Alexandrian/Hellenistic, Roman and Byzantine periods would be implied.I was also curious about the lack of comment about the Greek diaspora towards non-Mediteranean countries. There may be new shootoff articles there in the future. I don't have specific statistics, but there is a sizable community of Greek descendants in the U.S([[My Big Fat Greek Wedding]] being a perfect example of this), as well as other heterogeneous countries around the globe.--", "header": "Question", "id": 104, "parent_id": 0}
